Revit 2026 API

# StairsPathLineShapeAtCorner Enumeration

---

The options for the line shape of a stairs path at a corner.

**Namespace:** Autodesk.Revit.DB.Architecture**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public enum StairsPathLineShapeAtCorner
```
```vb
Public Enumeration StairsPathLineShapeAtCorner
```
```cpp
public enum class StairsPathLineShapeAtCorner
```
```fsharp
type StairsPathLineShapeAtCorner
```

| Member name | Value | Description |
| --- | --- | --- |
| Curved | 1 | The line shape of stairs path at the corner is curved. |
| Straight | 0 | The line shape of stairs path at the corner is straight. |

#### Reference

Autodesk.Revit.DB.Architecture Namespace